Процедура ДобавитьРеквизитКонтактноеЛицоВДокумент(Форма, ПолеРеквизита, ТипРеквизита, ПутьКДанным, Заголовок, ПередЭтим) Экспорт

	Группа = Форма;
	
	Если Форма.Элементы.Найти("ГруппаШапкаПраво") <> Неопределено Тогда
		Группа = Форма.Элементы.Найти("ГруппаШапкаПраво");
		ПолеКонтактныеЛица = Форма.Элементы.Добавить(ПолеРеквизита, ТипРеквизита, Группа);
	ИначеЕсли Форма.Элементы.Найти(ПередЭтим) <> Неопределено Тогда
		
		ПередЭтим = Форма.Элементы.Найти(ПередЭтим);
		
		ПолеКонтактныеЛица = Форма.Элементы.Вставить(
		ПолеРеквизита,
		ТипРеквизита,
		Группа,
		ПередЭтим); 
		
	КонецЕсли; 
	
	 
	ПолеКонтактныеЛица.Вид = ВидПоляФормы.ПолеВвода;
	ПолеКонтактныеЛица.ПутьКДанным = ПутьКДанным;
	ПолеКонтактныеЛица.Заголовок = Заголовок;
	ПолеКонтактныеЛица.УстановитьДействие("НачалоВыбора", "КонтактныеЛицаНачалоВыбора"); 
	
	
	
КонецПроцедуры