Процедура КонтактныеЛицаВыбор(Контрагент, Элемент) Экспорт
	 
	 Если Контрагент = Неопределено Тогда
	     Сообщить("Сначала выберите контрагента.");
	     СтандартнаяОбработка = Истина;
	     Возврат;
	 КонецЕсли;
	 
	 СтандартнаяОбработка = Ложь;
	 
	 // 1.Формируем структуру с условиями отбора
	 ПараметрыОтбора = Новый Структура;
	 
	 ПараметрыОтбора.Вставить("Владелец", Контрагент); 
	 
	 // 2.Упаковываем в параметры формы
	 ПараметрыФормы = Новый Структура;
	 ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	 
	 // 3.Открываем форму выбора
	 ОткрытьФорму("Справочник.ДЗ_КонтактныеЛица.ФормаВыбора", ПараметрыФормы, Элемент); 
	 
 КонецПроцедуры